Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.UpdateDrawing Method
 Updates the drawing. This is the same as pressing Update on the drawing list for a selected drawing. NOTE! The drawing cannot be active, otherwise the operation fails. NOTE! Numbering must be executed before this operation.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool UpdateDrawing(
	Drawing drawing
)
Public Function UpdateDrawing (
	drawing As Drawing
) As Boolean
Parameters
drawing
Type: Tekla.Structures.Drawing.Drawing
The drawing to be updated.
Return Value
Type: Boolean
True on success.
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace